Initial World Flag AI project
